{
  "lang": "en",
  "meta": {
    "title": "Fabrice Matulic Homepage",
    "description": "Homepage of Fabrice Matulic, Senior Researcher in HCI and Applied AI"
  },
  "header": {
    "name": "Fabrice Matulic, Ph.D."
  },
  "nav": {
    "lang_switch_text": "日本語",
    "lang_switch_target": "ja"
  },
  "intro": {
    "text": "I am a <strong>Senior Researcher</strong> at Preferred Networks Inc., Japan, and <strong>Assistant Professor</strong> at the University of Waterloo, Canada, in <strong>Human-Computer Interaction (HCI), Extended Reality (XR) and Applied AI</strong>. I have over 20 years of international experience leading research projects across academia and industry in multiple countries, including Canada (University of Waterloo), Germany (Technische Universität Dresden), the US (Microsoft Research, Redmond), Switzerland (ETH Zurich) and Japan (Ricoh and Preferred Networks, Tokyo). My current research explores novel interactive experiences and techniques that leverage the power of AI, mainly in XR, but also for interactive surfaces, mobile devices and embodied interaction. My work has resulted in over 50 contributions, including research papers at top-tier HCI conferences (CHI, UIST, ISS, etc.), several of which received awards, and numerous patents."
  },
  "teaser": {
    "alt_text": "Research Highlights Animation",
    "show_teaser": false
  },
  "sections": {
    "categories": "Filter by Category:",
    "patents": "Patents"
  },
  "categories": [
    { "id": "all", "name": "All", "logo": null },
    { "id": "xr", "name": "Extended Reality", "logo": null },
    { "id": "genai", "name": "Generative AI", "logo": null },
    { "id": "ml", "name": "Machine Learning", "logo": null },
    { "id": "cv", "name": "Computer Vision", "logo": null },
    { "id": "pen", "name": "Pen", "logo": null},
    { "id": "touch", "name": "Touch", "logo": null },
    { "id": "embodied", "name": "Embodied Interaction", "logo": null },
    { "id": "robotics", "name": "Robotics", "logo": null },
    { "id": "mobile", "name": "Mobile", "logo": null },
    { "id": "large-displays", "name": "Large Displays", "logo": null },
    { "id": "tabletop", "name": "Tabletops", "logo": null },
    { "id": "doc-eng", "name": "Document Engineering", "logo": null }
  ],
  "institutions": [
      { "id": "pfn", "name": "Preferred Networks, Inc.", "logo": "img/logos/PFN_logo_res.png", "url": "https://www.preferred.jp/en/" },
      { "id": "waterloo", "name": "University of Waterloo (HCI Lab)", "logo": "img/logos/UWaterloo.png", "url": "https://hci.uwaterloo.ca/" },
      { "id": "imld", "name": "Interactive Media Lab Dresden (TU Dresden)", "logo": "img/logos/IMLDLogo.png", "url": "https://imld.de/en/" },
      { "id": "msr", "name": "Microsoft Research", "logo": "img/logos/MSRLogo.png", "url": "https://www.microsoft.com/en-us/research/" },
      { "id": "eth", "name": "ETH Zurich (GlobIS)", "logo": "img/logos/ETHLogo.png", "url": "https://globis.ethz.ch/" },
      { "id": "ricoh", "name": "Ricoh Company, Ltd.", "logo": "img/logos/Ricoh_logo.png", "url": "https://www.ricoh.com/" }
  ],
  "contact": {
    "email": "fabrice.matulic [at] uwaterloo [dot] ca",
    "linkedin": "https://www.linkedin.com/in/fmatulic/",
    "address": null
  },
  "ui_text": {
      "tab_projects": "Projects",
      "tab_publications": "Publications",
      "tab_services": "Paper-Writing Support",
      "tab_contact": "Contact",
      "patents_section_title": "Patents",
      "publications": "Related Publications:",
      "pdf": "PDF",
      "video": "Video",
      "doi": "DOI",
      "patent_link": "Patent",
      "link_link": "Link",
      "thesis_link": "Thesis",
      "unknown_year": "Unknown Year",
      "no_projects_found": "No projects found for this category.",
      "no_publications_listed": "No publications listed.",
      "no_patents_listed": "No patents listed."
  },
  "services_pane_title": "HCI Paper Writing Support for Japan-Based Researchers",
  "services_description_html": "<h3>The Challenge: Publishing HCI Research Internationally</h3><p>Presenting your innovative HCI research at top-tier international conferences (CHI, UIST, etc.) and journals demands not only high-quality work but also exceptional clarity and persuasive writing in English. Meeting these rigorous standards can be particularly challenging for young researchers who aim to meet the specific stylistic, structural, and persuasive writing demands of highly competitive HCI publications.</p><p>While resources like translation services exist, they often lack deep, specialised knowledge of the HCI field, potentially missing nuances critical for accurately conveying contributions. AI language models can assist with drafting and refinement, but may struggle with complex scientific arguments, appropriate academic tone, structuring a paper logically for specific venues, and accurately translating visual content like figures. Furthermore, professors and senior researchers often face time constraints that limit their ability to provide intensive, hands-on writing support.</p><h3>My Solution: An Expert Writing Partnership</h3><p>Leveraging over 20 years of international research and paper-writing experience within HCI, I offer a <strong>collaborative co-writing service</strong> to help you prepare high-impact submissions for leading international venues.</p><p>This support goes significantly beyond standard proofreading or translation checks. As your writing partner, I will work closely with you to:</p><ul><li><strong>Develop a Strong Narrative:</strong> We'll structure your research findings into a compelling story that resonates with international reviewers and highlights your core contributions effectively.</li><li><strong>Refine Content & Presentation:</strong> We'll ensure your methodology, results, and discussion are presented clearly, rigorously, and persuasively, aligning with the expectations of top HCI venues.</li><li><strong>Elevate the Writing:</strong> I will assist in reformulating and polishing the text to ensure clear, concise, and high-quality scientific English. Having co-authored numerous papers with Japanese students and interns targeting international publication, and with reviewers consistently praising the writing quality of my publications (several of which received awards), I bring proven expertise to this process.</li><li><strong>Provide Expert Feedback:</strong> Leverage my extensive experience as an active HCI researcher, author, and reviewer at top venues to strengthen your submission. While my core expertise lies in interaction techniques for XR, Surface Computing, Embodied Interaction, and Applied AI, my broad experience reviewing for major HCI venues allows me to effectively support research across the wider HCI spectrum.</li><li><strong>Guide Venue Selection:</strong> Furthermore, if you are unsure about the most suitable venue or submission format (full paper, note, poster, demo etc.) for your work, I can offer guidance based on the research contribution and target audience.</li><li><strong>Bridge Cultural Gaps:</strong> As someone fluent in both English and Japanese and deeply familiar with both research environments, I can help adapt research originally conceived or presented in a Japanese context for maximum international impact. This includes navigating differences in argumentation style and presentation standards often seen between domestic and international publications.</li></ul><h3>Service Goal & Terms (Currently Free)</h3><p>My primary motivation is to help elevate excellent HCI research from Japan onto the global stage. Therefore, <strong>I am currently offering this collaborative writing support free of charge.</strong> However, I kindly request the following in return:</p><ol><li><strong>Co-authorship:</strong> To reflect the significant intellectual contribution to the writing and presentation, I would be included as a co-author on the submitted paper. The specific authorship order can be determined by the project lead based on contributions.</li><li><strong>Portfolio Inclusion:</strong> Permission to list the successfully published paper on my personal homepage.</li><li><strong>Presentation Rights:</strong> Permission to present the co-authored work at academic talks or other relevant events, always ensuring full and proper attribution to all authors and the home institution/lab (which also serves to increase your work's visibility).</li></ol><h3>The Process</h3><ol><li><strong>Initial Inquiry:</strong> Please reach out <strong>via email</strong> (see 'Contact' for address) with:<ul><li>A brief description of your research project.</li><li>The target international conference(s) or journal(s) (or indicate if you'd like suggestions).</li><li>The current status of the research and manuscript (e.g. completed work, Japanese draft, early English draft etc.).</li></ul></li><li><strong>Confidentiality:</strong> I am happy to sign a Non-Disclosure Agreement (NDA) to protect your research ideas.</li><li><strong>Project Assessment:</strong> I will review your inquiry to assess the fit between the research and potential target venues, and determine if I can provide meaningful support. I aim to collaborate on projects where I believe I can genuinely help maximise the potential for acceptance and impact. I will inform you promptly of my decision.</li><li><strong>Collaboration:</strong> If we proceed, we will work together closely through iterations of drafting, feedback, and revision to prepare the strongest possible submission.</li></ol><h3>Adapting Domestic Work</h3><p>A common scenario where this service can be particularly beneficial is adapting research already presented at a domestic conference in Japan for an international venue. This often requires more than simple translation. It requires restructuring the narrative, reframing contributions for a global audience, potentially identifying needs for supplementary experiments or analyses, and ensuring figures and videos are internationally accessible, challenges I am well-equipped to navigate with you.</p><h3>A Note on Timing and Tools</h3><p>To allow for meaningful collaboration and revision cycles, please contact me well in advance of any submission deadlines. For drafts that are already substantially complete, I typically require <strong>at least two full weeks</strong> prior to the deadline for review and co-writing, and ideally more to ensure thorough feedback incorporation. While I frequently use <strong>Overleaf</strong> for collaborative writing, I am flexible and happy to adapt to other platforms or workflows you prefer.</p><p>I look forward to potentially collaborating with you!</p>",
  "footer_copyright_text": "© {year} Fabrice Matulic. All rights reserved."
}
